grevaillot/svd_tools/headers/STM32L4x6/gpioe.h
#define GPIOE_PUPDR_PUPDR14_SHIFT		28
#define GPIOE_PUPDR_PUPDR14_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr14 PUPDR14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR13_SHIFT		26
#define GPIOE_PUPDR_PUPDR13_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr13 PUPDR13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR12_SHIFT		24
#define GPIOE_PUPDR_PUPDR12_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr12 PUPDR12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR11_SHIFT		22
#define GPIOE_PUPDR_PUPDR11_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr11 PUPDR11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR10_SHIFT		20
#define GPIOE_PUPDR_PUPDR10_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr10 PUPDR10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR9_SHIFT		18
#define GPIOE_PUPDR_PUPDR9_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr9 PUPDR9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR8_SHIFT		16
#define GPIOE_PUPDR_PUPDR8_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr8 PUPDR8 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR7_SHIFT		14
#define GPIOE_PUPDR_PUPDR7_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr7 PUPDR7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR6_SHIFT		12
#define GPIOE_PUPDR_PUPDR6_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr6 PUPDR6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR5_SHIFT		10
#define GPIOE_PUPDR_PUPDR5_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr5 PUPDR5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR4_SHIFT		8
#define GPIOE_PUPDR_PUPDR4_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr4 PUPDR4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR3_SHIFT		6
#define GPIOE_PUPDR_PUPDR3_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr3 PUPDR3 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR2_SHIFT		4
#define GPIOE_PUPDR_PUPDR2_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr2 PUPDR2 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR1_SHIFT		2
#define GPIOE_PUPDR_PUPDR1_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr1 PUPDR1 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOE_PUPDR_PUPDR0_SHIFT		0
#define GPIOE_PUPDR_PUPDR0_MASK		0x03
/** @defgroup gpioe_pupdr_pupdr0 PUPDR0 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioe_idr IDR GPIO port input data register
@{*/

/** GPIOE_IDR_IDR15 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR15		(1 << 15)
/** GPIOE_IDR_IDR14 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR14		(1 << 14)
/** GPIOE_IDR_IDR13 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR13		(1 << 13)
/** GPIOE_IDR_IDR12 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR12		(1 << 12)
/** GPIOE_IDR_IDR11 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR11		(1 << 11)
/** GPIOE_IDR_IDR10 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR10		(1 << 10)
/** GPIOE_IDR_IDR9 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR9		(1 << 9)
/** GPIOE_IDR_IDR8 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR8		(1 << 8)
/** GPIOE_IDR_IDR7 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR7		(1 << 7)
/** GPIOE_IDR_IDR6 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR6		(1 << 6)
/** GPIOE_IDR_IDR5 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR5		(1 << 5)
/** GPIOE_IDR_IDR4 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR4		(1 << 4)
/** GPIOE_IDR_IDR3 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR3		(1 << 3)
/** GPIOE_IDR_IDR2 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR2		(1 << 2)
/** GPIOE_IDR_IDR1 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR1		(1 << 1)
/** GPIOE_IDR_IDR0 Port input data (y = 0..15) **/
#define GPIOE_IDR_IDR0		(1 << 0)

/**@}*/

/** @defgroup gpioe_odr ODR GPIO port output data register
@{*/

/** GPIOE_ODR_ODR15 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR15		(1 << 15)
/** GPIOE_ODR_ODR14 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR14		(1 << 14)
/** GPIOE_ODR_ODR13 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR13		(1 << 13)
/** GPIOE_ODR_ODR12 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR12		(1 << 12)
/** GPIOE_ODR_ODR11 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR11		(1 << 11)
/** GPIOE_ODR_ODR10 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR10		(1 << 10)
/** GPIOE_ODR_ODR9 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR9		(1 << 9)
/** GPIOE_ODR_ODR8 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR8		(1 << 8)
/** GPIOE_ODR_ODR7 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR7		(1 << 7)
/** GPIOE_ODR_ODR6 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR6		(1 << 6)
/** GPIOE_ODR_ODR5 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR5		(1 << 5)
/** GPIOE_ODR_ODR4 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR4		(1 << 4)
/** GPIOE_ODR_ODR3 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR3		(1 << 3)
/** GPIOE_ODR_ODR2 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR2		(1 << 2)
/** GPIOE_ODR_ODR1 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR1		(1 << 1)
/** GPIOE_ODR_ODR0 Port output data (y = 0..15) **/
#define GPIOE_ODR_ODR0		(1 << 0)

/**@}*/

/** @defgroup gpioe_bsrr BSRR GPIO port bit set/reset register
@{*/

/** GPIOE_BSRR_BR15 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR15		(1 << 31)
/** GPIOE_BSRR_BR14 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR14		(1 << 30)
/** GPIOE_BSRR_BR13 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR13		(1 << 29)
/** GPIOE_BSRR_BR12 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR12		(1 << 28)
/** GPIOE_BSRR_BR11 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR11		(1 << 27)
/** GPIOE_BSRR_BR10 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR10		(1 << 26)
/** GPIOE_BSRR_BR9 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR9		(1 << 25)
/** GPIOE_BSRR_BR8 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR8		(1 << 24)
/** GPIOE_BSRR_BR7 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR7		(1 << 23)
/** GPIOE_BSRR_BR6 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR6		(1 << 22)
/** GPIOE_BSRR_BR5 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR5		(1 << 21)
/** GPIOE_BSRR_BR4 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR4		(1 << 20)
/** GPIOE_BSRR_BR3 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR3		(1 << 19)
/** GPIOE_BSRR_BR2 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR2		(1 << 18)
/** GPIOE_BSRR_BR1 Port x reset bit y (y = 0..15) **/
#define GPIOE_BSRR_BR1		(1 << 17)
/** GPIOE_BSRR_BR0 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BR0		(1 << 16)
/** GPIOE_BSRR_BS15 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS15		(1 << 15)
/** GPIOE_BSRR_BS14 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS14		(1 << 14)
/** GPIOE_BSRR_BS13 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS13		(1 << 13)
/** GPIOE_BSRR_BS12 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS12		(1 << 12)
/** GPIOE_BSRR_BS11 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS11		(1 << 11)
/** GPIOE_BSRR_BS10 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS10		(1 << 10)
/** GPIOE_BSRR_BS9 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS9		(1 << 9)
/** GPIOE_BSRR_BS8 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS8		(1 << 8)
/** GPIOE_BSRR_BS7 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS7		(1 << 7)
/** GPIOE_BSRR_BS6 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS6		(1 << 6)
/** GPIOE_BSRR_BS5 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS5		(1 << 5)
/** GPIOE_BSRR_BS4 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS4		(1 << 4)
/** GPIOE_BSRR_BS3 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS3		(1 << 3)
/** GPIOE_BSRR_BS2 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS2		(1 << 2)
/** GPIOE_BSRR_BS1 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS1		(1 << 1)
/** GPIOE_BSRR_BS0 Port x set bit y (y= 0..15) **/
#define GPIOE_BSRR_BS0		(1 << 0)

/**@}*/

/** @defgroup gpioe_lckr LCKR GPIO port configuration lock register
@{*/

